import 'package:places/domain/sight.dart';

final List mocks = <Sight>[
  Sight(
      name: 'Ворота Минска',
      lat: 53.89240348724916,
      lot: 27.551585330683277,
      url: 'https://34travel.me/media/upload/images/2016/december/Faq_belarus/cow_to_come_photo.jpg',
      details:
          "Если приехать в Минск на поезде, то первое, что увидишь, выйдя из главных дверей вокзала – это Ворота Минска – две высокие башни в стиле сталинского ампира. Построили их в начале 50-х на месте старых деревянных ворот, найденных тут при раскопках. На правой башне до сих пор висит герб бывшей БССР, а на левой – трофейные немецкие часы. Между прочим, это самые огромные часы в Беларуси – диаметр их циферблата составляет 3,5 метра. Также башни украшены скульптурами героев советского времени: рабочего, колхозницы, инженера и солдата – все по классике. Советуем ехать к Воротам Минска вечером – с подсветкой они выглядят особенно впечатляюще.",
      type: 'Архитектура'),
  Sight(
      name: 'Троицкое предместье',
      lat: 53.908297889831665,
      lot: 27.5565273067868,
      url: 'https://34travel.me/media/upload/images/2020/MARCH/new-gtb/IMG_2013.jpg',
      details:
          "Компактный островок «старого» Минска, именем которого в городе любят называть все что угодно: от магазинов и ресторанов до хлеба. Известно, что уже в XVI веке на месте современного Троицкого предместья селились горожане и ремесленники. Но в 1809 году тут произошел разрушительный пожар, который полностью выжег местность. Новое Троицкое было спланировано и выстроено под контролем самого Александра I: на 10 улицах разжились помещики, торговцы и другие горожане.",
      type: 'Архитектура'),
  Sight(
      name: 'Мемориальный комплекс «Яма»',
      lat: 53.90985923887155,
      lot: 27.542694138764762,
      url: 'https://34travel.me/media/upload/images/2018/november/34dstpr/jama.jpg',
      details:
          "Место памяти жертв самой страшной трагедии в истории еврейского народа – Холокоста. В 1942 году в «Яме» расстреляли 5 тысяч узников минского еврейского гетто, включая детей. Самый первый памятный знак установили тут в 1947 году, и это был единственный в СССР мемориал с надписью на идише. Современный памятник жертвам Холокоста поставили в 2000 году: 27 истощенных людей спускаются вниз по 17-ти ступеньками навстречу смерти. Еще одна часть комплекса – аллея Праведников мира, где высажены именные деревья в память о людях, которые рискуя собственной жизнью спасали евреев во время войны. Приходи сюда, чтобы просто помолчать в память о безвинно погибших людях.",
      type: 'Памятник')
];
